test/load-test/pin-search_populate_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            6000

Document Path:          /api/pins?latitude=0&longitude=0&radius=500&populate=true
Document Length:        397327 bytes

Concurrency Level:      10
Time taken for tests:   32.726 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      397559000 bytes
HTML transferred:       397327000 bytes
Requests per second:    30.56 [#/sec] (mean)
Time per request:       327.261 [ms] (mean)
Time per request:       32.726 [ms] (mean, across all concurrent requests)
Transfer rate:          11863.36 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    68  326  20.4    322     432
Waiting:       68  325  20.4    322     432
Total:         69  326  20.4    322     432

Percentage of the requests served within a certain time (ms)
  50%    322
  66%    325
  75%    327
  80%    331
  90%    349
  95%    362
  98%    377
  99%    385
 100%    432 (longest request)